# Задача 3.1.
# Создайте класс матрицы (или таблицы).
# Требования к классу:
#   - каждая колонка является числом от 1 до n (n любое число, которые вы поставите!)
#   - в каждой ячейке содержится либо число, либо None
#   - доступы следующие методы матрицы:
#       * принимать новые значения, 
#       * заменять существующие значения, 
#       * выводить число строк и колонок.

# Пример матрицы 10 на 10 из единиц:
# [[1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
#  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]]

# Примечание! 
#   - новый класс не запрещено строить на базе существующих типов данных: списков, словарей и тд.
#   - отображать в таблице/матрице название колонки не обязательно!
#   - использовать готовые классы numpy.array() и pandas.DataFrame() запрещено!
#   - проявите фантазию :)

class Matrix:
    def __init__(self, rows, cols):
        for i in range(rows):
            self._matrix = [[None] * cols for _ in range(rows)]

    def setValue(self, row, col, value):
        if row < self.getHeight() and col < self.getWidth():
            self._matrix[row][col] = value

    def getValue(self, row, col):
        if row < self.getHeight() and col < self.getWidth():
            return self._matrix[row][col]

    def getHeight(self):
        return len(self._matrix)

    def getWidth(self):
        return len(self._matrix[0])


# def printMatrix(m):
#     for row in range(m.getHeight()):
#         for col in range(m.getWidth()):
#             print(m.getValue(row, col), end=' ')
#         print()

# a = Matrix(12, 5)

# printMatrix(a)